Revit 2027 API
ThermalAsset.Equals(ThermalAsset) Method
 Determines whether this thermal asset is equal to another.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Equals(
	ThermalAsset other
)
Public Function Equals (
	other As ThermalAsset
) As Boolean
public:
bool Equals(
	ThermalAsset^ other
)
member Equals :
        other : ThermalAsset -> bool
Parameters
other ThermalAsset
 The thermal asset to compare with this one.
Return Value
Boolean
 True if the given thermal asset is equal to this one, otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ThermalAsset Class
Equals Overload
Autodesk.Revit.DB Namespace